Revit 2027 API
ViewOrientation3D.UpDirection Property
 The up direction vector
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ UpDirection { get; }
Public ReadOnly Property UpDirection As XYZ
	Get
public:
property XYZ^ UpDirection {
	XYZ^ get ();
}
member UpDirection : XYZ with get
Property Value
XYZ
See Also
Reference
ViewOrientation3D Class
Autodesk.Revit.DB Namespace